[
  {
    "id": 1,
    "name": "Investment Platform",
    "type": "Web App",
    "client": "",
    "tech": ["ReactJs", "Tailwind CSS", "Django", "SQLite3", "REST API"],
    "image": "patani",
    "link": "",
    "paragraphs": [
      "PATANI is the final project in the independent study program at Halofina which I developed as an investment platform to connect investors with farmers. This project is designed to provide digital solutions to support the agricultural sector. The platform's interface features interactive charts that provide an informative and easy-to-understand investment experience.",
      "The project is built using technologies such as ReactJS, Tailwind CSS, Django, and SQLite3, with a REST API as a link between the front-end and back-end. I take full responsibility for major feature development, bug fixes, and thorough testing to ensure platform quality. PATANI reflects my dedication and ability in designing and implementing comprehensive web applications."
    ]
  },
  {
    "id": 2,
    "name": "Proptech Academy",
    "type": "UI/UX Design",
    "client": "",
    "tech": ["Figma"],
    "image": "proptechAcademy",
    "link": "https://www.figma.com/proto/sA25YRcRGMqfdiFFKqLtOZ/Featured-Protech-Academy?page-id=52%3A2&node-id=80-926&viewport=1614%2C157%2C0.34&t=dYI0w4BSr9TBiD4b-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=80%3A926",
    "paragraphs": [
      "Proptech Academy is the final project of the Software Project course which is carried out in groups. This project focuses on developing a bold educational platform with an attractive and engaging interface. One of the superior features put forward is the gamification element, which is designed to increase user interaction and motivation in the learning process.",
      "The design of this project was done using Figma, with a focus on a custom display for mobile devices. The interface is designed to be attractive and easy to use, providing an optimal user experience. This project reflects solid team collaboration and my ability to design UI/UX that is innovative and meets user needs."
    ]
  },
  {
    "id": 3,
    "name": "Movie App",
    "type": "Web App",
    "client": "Personal Project",
    "tech": ["React", "Tailwind CSS", "TMDB API"],
    "image": "movieProject",
    "link": "https://nextflix-ecru.vercel.app/",
    "paragraphs": [
      "The Movie App is a front-end development project that showcases a variety of movies, allowing users to browse, search, and view detailed information about their favorite films. This app is powered by the TMDB API, providing up-to-date movie data.",
      "I built this project using React for the front-end and Tailwind CSS for styling. The app is designed with a responsive layout, ensuring a seamless experience on both desktop and mobile devices. This project reflects my skills in integrating APIs and creating dynamic user interfaces."
    ]
  },
  {
    "id": 4,
    "name": "Personal Web Portfolio",
    "type": "Website",
    "client": "",
    "tech": ["HTML", "Tailwind CSS", "Javascript", "ReactJs"],
    "image": "personalWebPortfolio",
    "link": "https://faiqmubarok.vercel.app",
    "paragraphs": [
      "Personal Web Portfolio is a website project showcasing my portfolio as a UI/UX Designer and Front-end Developer. The site is designed and developed using technologies like HTML, Tailwind CSS, JavaScript, and ReactJS. Its purpose is to provide a clear overview of my skills, experience, and the work I have produced in web design and development. The website highlights key projects, shares my background, and offers an easy way to get in touch with me."
    ]
  },
  {
    "id": 5,
    "name": "Personal Web Portfolio",
    "type": "UI/UX Design",
    "client": "",
    "tech": ["Figma"],
    "image": "personalWebPortofolioUi",
    "link": "https://www.figma.com/proto/I8PTX9BpKQXqzRXuXJnLhw/Personal-Web-Portfolio?page-id=0%3A1&node-id=22-10&viewport=1014%2C237%2C0.28&t=lTjbgyn9RdDblm5K-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=22%3A10",
    "paragraphs": [
      "Personal Web Portfolio is a UI/UX Design project that I created to showcase my personal portfolio professionally. The design was developed using Figma, with a focus on creating an intuitive, responsive, and aesthetically pleasing interface. The goal of this project was to deliver an optimal user experience while highlighting my skills in UI/UX design. In this portfolio, I visualized concepts and layouts that enable users to easily explore my work and learn more about me."
    ]
  },
  {
    "id": 6,
    "name": "Proptech Web App",
    "type": "Web App",
    "client": "U Kost Indonesia",
    "tech": ["HTML", "Tailwind CSS", "Flowbite", "ReactJs", "Laravel", "MySQL"],
    "image": "ukostProptech",
    "link": "",
    "paragraphs": [
      "Proptech Web App is a web application developed for U Kost Indonesia aimed at simplifying the process of searching for and managing rental properties, such as boarding houses and rental homes. This app offers comprehensive search features, enabling users to find properties based on location, price, and desired amenities.",
      "This project was a collaborative effort, with me taking the role of frontend developer. I utilized HTML, Tailwind CSS, Flowbite, and ReactJs to create an intuitive and responsive user interface, ensuring a seamless user experience across various devices. The backend of this application was built using Laravel and MySQL, ensuring efficient data handling and system functionality.",
      "With this app, users can effortlessly explore a wide range of boarding houses and rental homes, view detailed property information, and make informed decisions before proceeding to the booking stage."
    ]
  },
  {
    "id": 7,
    "name": "Kopidia Ordering App",
    "type": "UI/UX Design",
    "client": "Karsadia Culture Space",
    "tech": ["Figma"],
    "image": "kopidiaOrderingApp",
    "link": "https://www.figma.com/proto/W0OuuktClFfFnPoRK4Avcd/Untitled?page-id=0%3A1&node-id=1-5&viewport=1354%2C1657%2C0.33&t=2qqOLB1OqImiDBya-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=1%3A5",
    "paragraphs": [
      "Kopidia Ordering App is a UI/UX design project developed for Karsadia Culture Space, specifically for Kopidia, a coffee shop located in Purwokerto. This app is designed to streamline the ordering process for coffee and food at Kopidia, allowing customers to easily browse the menu, add items to their cart, and complete transactions.",
      "In this project, I used Figma to create a user-friendly interface. The design focuses on providing an efficient and intuitive ordering experience, ensuring that customers can enjoy Kopidia’s services with greater ease and speed."
    ]
  },
  {
    "id": 8,
    "name": "JPay Fintech App",
    "type": "UI/UX Design",
    "client": "",
    "tech": ["Figma"],
    "image": "fintechJayadi",
    "link": "https://www.figma.com/proto/mX6P8Ech0NhoHnxSQglhrI/JPay-Mobile-Payment?page-id=0%3A1&node-id=102-1645&viewport=158%2C426%2C0.17&t=oT6qYIUTZrnuHMKc-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=102%3A1645&show-proto-sidebar=1",
    "paragraphs": [
      "JPay Fintech App is a UI/UX design project developed as the final assignment for the Introduction to Software Engineering course. This application is designed as a digital wallet platform, similar to popular fintech apps like LinkAja, DANA, and ShopeePay. The primary goal of this app is to provide users with a secure and convenient solution for managing their financial transactions digitally.",
      "In this project, I utilized Figma to create an intuitive and user-friendly interface. The design focuses on key features such as mobile payments, bill payments, and money transfers, ensuring a smooth and efficient user experience."
    ]
  },
  {
    "id": 9,
    "name": "Roadwave E-Commerce",
    "type": "Web App",
    "client": "Roadwave Apparel",
    "tech": ["HTML", "Tailwind CSS", "Laravel", "MySQL"],
    "image": "roadwaveEcommerce",
    "link": "",
    "paragraphs": [
      "Roadwave E-Commerce is a web application developed for Roadwave Apparel, an apparel brand that sells its products online. This project was created as the final assignment for my Web Programming Design course, where I took on the role of frontend developer.",
      "My responsibility in this project was to design an attractive and responsive user interface, ensuring that customers can easily browse and purchase products across various devices. Using technologies such as HTML, Tailwind CSS, Laravel, and MySQL, this application was crafted to deliver a seamless and enjoyable online shopping experience for Roadwave Apparel’s customers."
    ]
  }
]
